kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_CMD;
  msp_out.flags = MSP_VERSION | MSP_STARTFLAG;
  msp_out.function = MSP_VTX_SET_CONFIG;
  msp_out.payloadSize = sizeof(vtx_cmd);
  memcpy((void*)msp_out.payload, vtx_cmd, sizeof(vtx_cmd));
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

#if CONFIG_HANDSET
uint8_t char_to_hex(uint8_t chr)
{
  if ('A' <= chr)
    chr = 10 + (chr - 'A');
  else
    chr = chr - '0';
  return chr;
}

uint8_t u8_to_hex(uint8_t * chr)
{
  uint8_t val = char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  return val;
}

uint16_t u12_to_hex(uint8_t * chr)
{
  uint16_t val = char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  val <<= 4;
  val += char_to_hex(*chr++);
  return val;
}

void handleHandsetCalibrate(const char * input)
{
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_CALIBRATE;
  msp_out.payloadSize = 2;
  if (!strncmp(input, "thr", 3)) {
    msp_out.payload[0] = GIMBAL_CALIB_THR;
  } else if (!strncmp(input, "yaw", 3)) {
    msp_out.payload[0] = GIMBAL_CALIB_YAW;
  } else if (!strncmp(input, "pit", 3)) {
    msp_out.payload[0] = GIMBAL_CALIB_PITCH;
  } else if (!strncmp(input, "rol", 3)) {
    msp_out.payload[0] = GIMBAL_CALIB_ROLL;
  }
  msp_out.payload[1] = 1; // Start
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetCalibrateResp(uint8_t * data, int num = -1)
{
  String out = "ELRS_handset_calibrate=";
  if (data && data[0] == 1)
    out += "SUCCESS";
  else
    out += "ERROR!";

  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}


void handleHandsetMixer(const char * input, size_t length)
{
  webSocket.broadcastTXT(input, length);
  uint32_t iter;
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_MIXER;
  for (iter = 0; iter < (3 * TX_NUM_MIXER) && (iter < length); iter+=3) {
    // channel index
    msp_out.payload[iter] = char_to_hex(input[iter]);
    // channel out
    msp_out.payload[iter+1] = char_to_hex(input[iter+1]);
    // inverted
    msp_out.payload[iter+2] = char_to_hex(input[iter+2]);
  }
  msp_out.payloadSize = iter;
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetMixerResp(uint8_t * data, int num = -1)
{
  String out = "ELRS_handset_mixer=";
  uint8_t iter;
  if (data) {
    for (iter = 0; iter < ARRAY_SIZE(mixer); iter++) {
      if (data[0] < ARRAY_SIZE(mixer)) {
        mixer[iter] = (struct mixer){.index=data[1], .inv=data[2]};
      }
      data += 3;
    }
    handset_num_switches = *data++;
    handset_num_aux = *data++;
    String temp = "Num switches: ";
    temp += handset_num_switches;
    temp += " , num aux: ";
    temp += handset_num_aux;
    webSocket.broadcastTXT(temp);
  }

  out += handset_num_aux;
  out += ";";
  out += handset_num_switches;
  out += ";";

  for (iter = 0; iter < ARRAY_SIZE(mixer); iter++) {
    if (iter)
      out += ',';
    out += iter;
    out += ":";
    out += mixer[iter].index;
    out += ":";
    out += mixer[iter].inv;
  }

  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}


void handleHandsetAdjust(const char * input)
{
  uint16_t value;
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function =
    !strncmp(input, "_min", 4) ?
      ELRS_HANDSET_ADJUST_MIN :
      (!strncmp(input, "_max", 4) ?
        ELRS_HANDSET_ADJUST_MAX :
        ELRS_HANDSET_ADJUST_MID);
  msp_out.payloadSize = 3;
  if (!strncmp(input, "thr", 3)) {
    msp_out.payload[0] = GIMBAL_IDX_R1;
  } else if (!strncmp(input, "yaw", 3)) {
    msp_out.payload[0] = GIMBAL_IDX_R2;
  } else if (!strncmp(input, "pit", 3)) {
    msp_out.payload[0] = GIMBAL_IDX_L1;
  } else if (!strncmp(input, "rol", 3)) {
    msp_out.payload[0] = GIMBAL_IDX_L2;
  }
  uint8_t * temp = (uint8_t*)strstr((char*)input, "=");
  value = u12_to_hex(temp);
  msp_out.payload[1] = (uint8_t)(value >> 8);
  msp_out.payload[2] = (uint8_t)value;
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

void handleHandsetAdjustChannelResp(uint8_t type, struct gimbal_limit * limits, int num)
{
  String out = "ELRS_handset_adjust_";
  switch (type)
  {
  case GIMBAL_IDX_L1:
    out += "pit=";
    break;
  case GIMBAL_IDX_L2:
    out += "rol=";
    break;
  case GIMBAL_IDX_R1:
    out += "thr=";
    break;
  case GIMBAL_IDX_R2:
    out += "yaw=";
    break;
  default:
    return;
  }
  out += limits->low;
  out += ":";
  out += limits->mid;
  out += ":";
  out += limits->high;
  if (0 <= num)
    webSocket.sendTXT(num, out);
  else
    webSocket.broadcastTXT(out);
}

void handleHandsetAdjustResp(uint8_t * data, int num = -1)
{
  uint16_t min, mid, max;
  uint8_t iter;
  if (data) {
    for (iter = 0; iter < ARRAY_SIZE(gimbals); iter++) {
      if (data[0] < ARRAY_SIZE(gimbals)) {
        min = ((uint16_t)data[1] << 8) + data[2];
        mid = ((uint16_t)data[3] << 8) + data[4];
        max = ((uint16_t)data[5] << 8) + data[6];
        gimbals[data[0]] = (struct gimbal_limit){.low=min, .mid=mid, .high=max};
      }
      data += 7;
    }
  }

  for (iter = 0; iter < ARRAY_SIZE(gimbals); iter++) {
    handleHandsetAdjustChannelResp(iter, &gimbals[iter], num);
  }
}

void HandsetConfigGet(uint8_t wsnum, uint8_t force=0)
{
  if (!handset_mixer_ok || !handset_adjust_ok || force) {
    // Fill MSP packet
    msp_out.reset();
    msp_out.type = MSP_PACKET_V1_ELRS;
    msp_out.flags = MSP_ELRS_INT;
    msp_out.function = ELRS_HANDSET_CONFIGS_LOAD;
    msp_out.payload[0] = 1;
    msp_out.payload[1] = 1;
    msp_out.payloadSize = 2;
    // Send packet
    MSP::sendPacket(&msp_out, &my_ctrl_serial);
    return;
  }

  handleHandsetMixerResp(NULL, wsnum);
  handleHandsetAdjustResp(NULL, wsnum);
}

void HandsetConfigSave(uint8_t wsnum)
{
  // Fill MSP packet
  msp_out.reset();
  msp_out.type = MSP_PACKET_V1_ELRS;
  msp_out.flags = MSP_ELRS_INT;
  msp_out.function = ELRS_HANDSET_CONFIGS_SAVE;
  msp_out.payload[0] = 1;
  msp_out.payload[1] = 1;
  msp_out.payloadSize = 2;
  // Send packet
  MSP::sendPacket(&msp_out, &my_ctrl_serial);
}

#endif // CONFIG_HANDSET


void webSocketEvent(uint8_t num, WStype_t type, uint8_t *payload, size_t length)
{
  char * temp;
  //Serial.printf("webSocketEvent(%d, %d, ...)\r\n", num, type);

  switch (type)
  {
  case WStype_DISCONNECTED:
    //Serial.printf("[%u] Disconnected!\r\n", num);
    break;
  case WStype_CONNECTED:
  {
    //IPAddress ip = webSocket.remoteIP(num);
    //Serial.printf("[%u] Connected from %d.%d.%d.%d url: %s\r\n", num, ip[0], ip[1], ip[2], ip[3], payload);
    //socketNumber = num;

    webSocket.sendTXT(num, my_ipaddress_info_str);
#if ESP_NOW
    webSocket.sendTXT(num, espnow_init_info);
#endif

    // Send settings
    SettingsGet(num);
#if CONFIG_HANDSET
    HandsetConfigGet(num);
#endif
  }
  break;
  case WStype_TEXT:
    //Serial.printf("[%u] get Text: %s\r\n", num, payload);
    // send data to all connected clients
    //webSocket.broadcastTXT(payload, length);

    temp = strstr((char*)payload, "stm32_cmd=");
    if (temp) {
      // Command STM32
      if (strstr((char*)&temp[10], "reset")) {
        // Reset STM32
        reset_stm32_to_app_mode();
      }
    } else {

