kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
#if CONFIG_HANDSET
      /* Handset specific */
      temp = strstr((char*)payload, "handset_");
      if (temp) {

        // handset_mixer=
        temp = strstr((char*)payload, "mixer=");
        if (temp) {
          temp = &temp[6];
          handleHandsetMixer(temp, (length - ((uintptr_t)temp - (uintptr_t)payload)));
          break;
        }

        // handset_calibrate=
        temp = strstr((char*)payload, "calibrate=");
        if (temp) {
          handleHandsetCalibrate(&temp[10]);
          break;
        }

        // handset_adjust_[axe]_[min|max]=val
        temp = strstr((char*)payload, "_adjust_");
        if (temp) {
          handleHandsetAdjust(&temp[8]);
          break;
        }

        temp = strstr((char*)payload, "_refresh");
        if (temp) {
          HandsetConfigGet(num, 1);
          break;
        }

        temp = strstr((char*)payload, "_save");
        if (temp) {
          HandsetConfigSave(num);
          break;
        }

      } else
#endif // CONFIG_HANDSET

      {
        // ExLRS setting commands
        temp = strstr((char*)payload, "S_rate");
        if (temp) {
          handleSettingRate(&temp[6], num);
          break;
        }
        temp = strstr((char*)payload, "S_power");
        if (temp) {
          handleSettingPower(&temp[7], num);
          break;
        }
        temp = strstr((char*)payload, "S_telemetry");
        if (temp) {
          handleSettingTlm(&temp[11], num);
          break;
        }
        temp = strstr((char*)payload, "S_vtx_freq");
        if (temp) {
          MspVtxWrite(&temp[10], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_pwr");
        if (temp) {
          handleSettingRfPwr(&temp[8], num);
          break;
        }
        temp = strstr((char*)payload, "S_rf_module");
        if (temp) {
          handleSettingRfModule(&temp[11], num);
          break;
        }
      }
    }
    break;
  case WStype_BIN:
    //Serial.printf("[%u] get binary length: %u\r\n", num, length);
    hexdump(payload, length);

    // echo data back to browser
    webSocket.sendBIN(num, payload, length);
    break;
  default:
    //Serial.printf("Invalid WStype [%d]\r\n", type);
    //webSocket.broadcastTXT("Invalid WStype: " + type);
    break;
  }
}

/***********************************************************************************/
/*************                   STM32 OTA UPGRADE                     *************/

int8_t flash_stm32(uint32_t flash_addr)
{
  int8_t result = -1;
  webSocket.broadcastTXT("STM32 Firmware Flash Requested!");
  webSocket.broadcastTXT("  the firmware file: '" + uploadedfilename + "'");
  if (uploadedfilename.endsWith("firmware.elrs")) {
    result = stk500_write_file(uploadedfilename.c_str());
  } else if (uploadedfilename.endsWith("firmware.bin")) {
    result = esp8266_spifs_write_file(uploadedfilename.c_str(), flash_addr);
    if (result == 0)
      reset_stm32_to_app_mode(); // boot into app
  } else {
    webSocket.broadcastTXT("Invalid file!");
  }
  Serial.begin(SERIAL_BAUD);
  return result;
}

void handleFileUploadEnd()
{
  uint32_t flash_base = BEGIN_ADDRESS;
  //String message = "\nRequest params:\n";
  for (uint8_t i = 0; i < server.args(); i++) {
    String name = server.argName(i);
    String value = server.arg(i);
      //message += " " + name + ": " + value + "\n";
      if (name == "flash_address") {
        flash_base = strtol(&value.c_str()[2], NULL, 16);
        break;
      }
  }
  //webSocket.broadcastTXT(message);

  int8_t success = flash_stm32(flash_base);

  if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
    FILESYSTEM.remove(uploadedfilename);

  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (success) ? "Update Successful!": "Update Failure!");
  server.send((success < 0) ? 400 : 200);
}

void handleFileUpload()
{ // upload a new file to the SPIFFS
  HTTPUpload &upload = server.upload();
  if (upload.status == UPLOAD_FILE_START)
  {
    /* Remove old file */
    if (uploadedfilename.length() && FILESYSTEM.exists(uploadedfilename))
      FILESYSTEM.remove(uploadedfilename);

    FSInfo fs_info;
    if (FILESYSTEM.info(fs_info))
    {
      Dir dir = FILESYSTEM.openDir("/");
      while (dir.next()) {
        String file = dir.fileName();
        if (file.endsWith(".bin")) {
          FILESYSTEM.remove(file);
        }
      }

      String output = "Filesystem: used: ";
      output += fs_info.usedBytes;
      output += " / free: ";
      output += fs_info.totalBytes;
      webSocket.broadcastTXT(output);

      if (fs_info.usedBytes > 0) {
        //webSocket.broadcastTXT("formatting filesystem");
        //FILESYSTEM.format();
      }
    }
    else
    {
      webSocket.broadcastTXT("SPIFFs Failed to init!");
      return;
    }
    uploadedfilename = upload.filename;

    webSocket.broadcastTXT("Uploading file: " + uploadedfilename);

    if (!uploadedfilename.startsWith("/"))
    {
      uploadedfilename = "/" + uploadedfilename;
    }
    fsUploadFile = FILESYSTEM.open(uploadedfilename, "w"); // Open the file for writing in SPIFFS (create if it doesn't exist)
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (fsUploadFile)
    {
      fsUploadFile.write(upload.buf, upload.currentSize); // Write the received bytes to the file
      String output = "Uploaded: ";
      output += fsUploadFile.position();
      output += " bytes";
      webSocket.broadcastTXT(output);
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (fsUploadFile)
    {                       // If the file was successfully created
      String totsize = "Total uploaded size ";
      totsize += fsUploadFile.position();
      totsize += " of ";
      totsize += upload.totalSize;
      webSocket.broadcastTXT(totsize);
      server.send(100);
      fsUploadFile.close(); // Close the file again
    }
    else
    {
      server.send(500, "text/plain", "500: couldn't create file");
    }
  }
}

