kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
/***********************************************************************************/
/*************                    ESP OTA UPGRADE                      *************/
#define LOCAL_OTA 0
#if LOCAL_OTA
void handle_upgrade_error(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
}

void handleEspUpgrade(void)
{
  HTTPUpload& upload = server.upload();
  if (upload.status == UPLOAD_FILE_START) {
    //Serial.setDebugOutput(true);
    WiFiUDP::stopAll();
    //Serial.printf("Update: %s\n", upload.filename.c_str());
    webSocket.broadcastTXT("*** ESP OTA ***\n  file: " + upload.filename);

    /*if (upload.name != "backpack_fw") {
      webSocket.broadcastTXT("Invalid upload type!");
      return;
    } else*/ if (!upload.filename.startsWith("backpack.bin")) {
      webSocket.broadcastTXT("Invalid file! Update aborted...");
      handle_upgrade_error();
      return;
    }

    uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
    if (!Update.begin(maxSketchSpace, U_FLASH)) { //start with max available size
      //Update.printError(Serial);
      webSocket.broadcastTXT("File is too big!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Junk write failed!");
      handle_upgrade_error();
    }
  } else if (upload.status == UPLOAD_FILE_END) {
    if (Update.end(true)) { //true to set the size to the current progress
      //Serial.printf("Update Success: %u\nRebooting...\n", upload.totalSize);
      webSocket.broadcastTXT("Update Success! Rebooting...");
    } else {
      //Update.printError(Serial);
      webSocket.broadcastTXT("Update failed!");
    }
    //Serial.setDebugOutput(false);
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    Update.end();
  }
  delay(0); //same as yield();
}

void handleEspUpgradeFinalize(void)
{
  server.sendHeader("Location", "/return");          // Redirect the client to the success page
  server.send(303);
  webSocket.broadcastTXT(
    (Update.hasError()) ? "Update Failure!" : "Update Successful!");
  server.send(Update.hasError() ? 200 : 400);
  //server.sendHeader("Connection", "close");
  //server.send(200, "text/plain", (Update.hasError()) ? "FAIL" : "OK");
  ESP.restart();
}
#endif // LOCAL_OTA

/***********************************************************************************/

void sendReturn()
{
  server.send_P(200, "text/html", GO_BACK);
}

void handle_recover()
{
  server.send_P(200, "text/html", INDEX_HTML);
}

void handleMacAddress()
{
  String message = "WiFi STA MAC: ";
  message += WiFi.macAddress();
  message += "\n  - channel in use: ";
  message += wifi_get_channel();
  message += "\n  - mode: ";
  message += (uint8_t)WiFi.getMode();
  message += "\n\nWiFi SoftAP MAC: ";
  message += WiFi.softAPmacAddress();
  message += "\n  - IP: ";
  message += WiFi.softAPIP().toString();
  message += "\n";
  server.send(200, "text/plain", message);
}

void handle_fs(void)
{
  FSInfo fs_info;
  FILESYSTEM.info(fs_info);
  String message = "FS ino: used ";
  message += fs_info.usedBytes;
  message += "/";
  message += fs_info.totalBytes;
  message += "\n**** FS files ****\n";

  Dir dir = FILESYSTEM.openDir("/");
  while (dir.next()) {
      message += dir.fileName();
      if(dir.fileSize()) {
          File f = dir.openFile("r");
          message += " - ";
          message += f.size();
          message += "B";
      }
      message += "\n";
  }

  server.send(200, "text/plain", message);
}

String getContentType(String filename)
{
  if(filename.endsWith(".html"))
    return "text/html";
  else if(filename.endsWith(".css"))
    return "text/css";
  else if(filename.endsWith(".js"))
    return "application/javascript";
  else if(filename.endsWith(".ico"))
    return "image/x-icon";
  else if(filename.endsWith(".gz"))
    return "application/x-gzip";
  return "text/plain";
}

bool handleFileRead(String path)
{
  if (path.endsWith("/"))
    // Send the index file if a folder is requested
    path += "index.html";
  // Get the MIME type
  String contentType = getContentType(path);
  uint8_t pathWithGz = FILESYSTEM.exists(path + ".gz");
  if (pathWithGz || FILESYSTEM.exists(path)) {
    if (pathWithGz)
      path += ".gz";
    File file = FILESYSTEM.open(path, "r");
    server.streamFile(file, contentType);
    file.close();
    return true;
  }
  return false;
}

/******************* ESP-NOW *********************/
#if ESP_NOW

#include <espnow.h>

class CtrlSerialEspNow: public CtrlSerial
{
public:
  size_t available(void) {
    return 0; // not used
  }
  uint8_t read(void) {
    return 0; // not used
  }

  void write(uint8_t * buffer, size_t size) {
    while (size-- && p_iterator < sizeof(p_buffer)) {
      p_buffer[p_iterator++] = *buffer++;
    }
    if (p_iterator >= sizeof(p_buffer))
      p_iterator = UINT8_MAX; // error, not enough space
  }

  void reset(void) {
    p_iterator = 0;
  }
  void send_now(mspPacket_t *msp_in) {
    reset();
    if (MSP::sendPacket(msp_in, this) && p_iterator <= sizeof(p_buffer)) // check overflow
    {
      MSP::sendPacket(msp_in, this);
      esp_now_send(NULL, (uint8_t*)p_buffer, p_iterator);
      //webSocket.broadcastTXT("MSP sent!");
    }
  }

private:
  uint8_t p_buffer[128];
  uint8_t p_iterator = 0;
};

CtrlSerialEspNow esp_now_sender;

void esp_now_recv_cb(uint8_t *mac_addr, uint8_t *data, uint8_t data_len)
{
  /* No data or peer is unknown => ignore */
  if (!data_len || !esp_now_is_peer_exist(mac_addr))
    return;

  webSocket.broadcastTXT("ESP NOW message received!");

  // Pass data to ERLS
  // Note: accepts only correctly formatted MSP packets
  Serial.write((uint8_t*)data, data_len);
}

