kordets/ExpressLRS/src/utils/ESP8266SerialToWebsocket/src/main.cpp
void esp_now_send_cb(uint8_t *mac_addr, u8 status) {
#if 0
  String temp = "ESPNOW Sent: ";
  temp += (status ? "FAIL" : "SUCCESS");
  webSocket.broadcastTXT(temp);
#endif
}

void init_esp_now(void)
{
  espnow_init_info = "ESP NOW init... ";

  if (esp_now_init() != 0) {
    espnow_init_info += "ESP NOW init failed!";
    return;
  }
  esp_now_set_self_role(ESP_NOW_ROLE_COMBO);
  esp_now_register_send_cb(esp_now_send_cb);
  esp_now_register_recv_cb(esp_now_recv_cb);

#ifdef ESP_NOW_PEERS
#define ESP_NOW_ETH_ALEN 6
  uint8_t peers[][ESP_NOW_ETH_ALEN] = ESP_NOW_PEERS;
  uint8_t num_peers = sizeof(peers) / ESP_NOW_ETH_ALEN;
  for (uint8_t iter = 0; iter < num_peers; iter++) {
    //esp_now_del_peer(peers[iter]);
    if (esp_now_add_peer(peers[iter], ESP_NOW_ROLE_COMBO, ESP_NOW_CHANNEL, NULL, 0) != 0) {
      espnow_init_info += ", PEER ";
      espnow_init_info += iter;
      espnow_init_info += " FAIL";
    }
  }
#endif // ESP_NOW_PEERS

  espnow_init_info += " - Init DONE!";
}
#endif // ESP_NOW
/*************************************************/

void setup()
{
  IPAddress my_ip;
  uint8_t sta_up = 0;
  rst_info *resetInfo;
  resetInfo = ESP.getResetInfoPtr();
  int reset_reason = resetInfo->reason;

  msp_handler.markPacketFree();

  /* Reset values */
  settings_rate = 1;
  settings_power = 4;
  settings_power_max = 8;
  settings_tlm = 7;
  settings_region = 255;
#if CONFIG_HANDSET
  handset_num_switches = 6;
  handset_num_aux = 5;
  handset_mixer_ok = 0;
  handset_adjust_ok = 0;
#endif

  //Serial.setRxBufferSize(256);
#ifdef INVERTED_SERIAL
  // inverted serial
  Serial.begin(SERIAL_BAUD, SERIAL_8N1, SERIAL_FULL, 1, true);
#else
  // non-inverted serial
  Serial.begin(SERIAL_BAUD);
#endif

#if (BOOT0_PIN == 2 || BOOT0_PIN == 0)
  reset_stm32_to_app_mode();
#endif

  FILESYSTEM.begin();
  //FILESYSTEM.format();

  wifi_station_set_hostname("elrs_tx");

#if defined(WIFI_SSID) && defined(WIFI_PSK)
  if (WiFi.status() != WL_CONNECTED) {
    WiFi.mode(WIFI_STA);
    WiFi.begin(WIFI_SSID, WIFI_PSK, WIFI_CHANNEL);
  }
  uint32_t i = 0;
#define TIMEOUT (WIFI_TIMEOUT * 10)
  while (WiFi.status() != WL_CONNECTED)
  {
    delay(100);
    if (++i > TIMEOUT) {
      break;
    }
  }
  sta_up = (WiFi.status() == WL_CONNECTED);

#elif WIFI_MANAGER
  WiFiManager wifiManager;
  wifiManager.setConfigPortalTimeout(WIFI_TIMEOUT);
  if (wifiManager.autoConnect(WIFI_AP_SSID " R9M")) {
    // AP found, connected
    sta_up = 1;
  }
#endif /* WIFI_MANAGER */

  if (!sta_up)
  {
    // WiFi not connected, Start access point
    WiFi.mode(WIFI_AP);
    WiFi.softAP(WIFI_AP_SSID " R9M", WIFI_AP_PSK, ESP_NOW_CHANNEL);
  }

#if ESP_NOW
  init_esp_now();
#endif // ESP_NOW

  my_ip = (sta_up) ? WiFi.localIP() : WiFi.softAPIP();

  if (mdns.begin("elrs_tx", my_ip))
  {
    mdns.addService("http", "tcp", 80);
    mdns.addService("ws", "tcp", 81);
  }
  my_ipaddress_info_str = "My IP address = ";
  my_ipaddress_info_str += my_ip.toString();
  my_ipaddress_info_str += " (RST: ";
  my_ipaddress_info_str += reset_reason;
  my_ipaddress_info_str += ")";

#if 0 && defined(LATEST_COMMIT)
  my_ipaddress_info_str += "\nCurrent version (SHA): ";
  uint8_t commit_sha[] = {LATEST_COMMIT};
  for (uint8_t iter = 0; iter < sizeof(commit_sha); iter++)

#endif // LATEST_COMMIT

  //Serial.print("Connect to http://elrs_tx.local or http://");
  //Serial.println(my_ip);

  server.on("/fs", handle_fs);
  server.on("/return", sendReturn);
  server.on("/mac", handleMacAddress);
#if LOCAL_OTA
  server.on("/update_tst", HTTP_POST, // ESP OTA upgrade
    handleEspUpgradeFinalize, handleEspUpgrade);
#endif // LOCAL_OTA
  server.on("/upload", HTTP_POST, // STM32 OTA upgrade
    handleFileUploadEnd, handleFileUpload);
  server.onNotFound([]() {
    if (!handleFileRead(server.uri())) {
      // No matching file, respond with a 404 (Not Found) error
      //server.send(404, "text/plain", "404: Not Found");
      handle_recover();
    }
  });

  httpUpdater.setup(&server);
  server.begin();

  webSocket.begin();
  webSocket.onEvent(webSocketEvent);
}

int serialEvent()
{
  int temp;
  uint8_t inChar;
  while (Serial.available())
  {
    temp = Serial.read();
    if (temp < 0)
      break;

    inChar = (uint8_t)temp;
    if (msp_handler.processReceivedByte(inChar)) {
      webSocket.broadcastTXT("MSP received");
      // msp fully received
      mspPacket_t &msp_in = msp_handler.getPacket();
      if (msp_in.type == MSP_PACKET_V1_ELRS) {
        uint8_t * payload = (uint8_t*)msp_in.payload;
        switch (msp_in.function) {
          case ELRS_INT_MSP_PARAMS: {
            webSocket.broadcastTXT("ELRS params resp");
            settings_rate = payload[0];
            settings_tlm = payload[1];
            settings_power = payload[2];
            settings_power_max = payload[3];
            settings_region = payload[4];

            handleSettingDomain(NULL);
            handleSettingRate(NULL);
            handleSettingPower(NULL);
            handleSettingTlm(NULL);
            break;
          }
#if CONFIG_HANDSET
          case ELRS_HANDSET_CALIBRATE: {
            webSocket.broadcastTXT("CALIBRATE config");
            handleHandsetCalibrateResp(payload);
            break;
          }
          case ELRS_HANDSET_MIXER: {
            webSocket.broadcastTXT("MIXER config");
            handleHandsetMixerResp(payload);
            handset_mixer_ok = 1;
            break;
          }
          case ELRS_HANDSET_ADJUST: {
            webSocket.broadcastTXT("ADJUST config");
            handleHandsetAdjustResp(payload);
            handset_adjust_ok = 1;
            break;
          }
#endif /* CONFIG_HANDSET */
          default:
            break;
        };
      }

      yield();
#if ESP_NOW
      // Send received MSP packet to clients
      esp_now_sender.send_now(&msp_in);
#endif

      msp_handler.markPacketFree();
    } else if (!msp_handler.mspOngoing()) {
      if (inChar == '\r') {
        continue;
      } else if (inChar == '\n' || 128 <= inputString.length()) {
        return 0;
      }
      if (isprint(inChar))
        inputString += (char)inChar;
    }

    //if (msp_handler.error())
    //  msp_handler.markPacketFree();

    yield();
  }
  return -1;
}

void loop()
{
  if (0 <= serialEvent())
  {
    webSocket.broadcastTXT(inputString);
    inputString = "";
  }

  server.handleClient();
  webSocket.loop();
  mdns.update();
}
